package com.dm;

/*
    包：package 对类进行分类管理
    导包：import 包名
    修饰符
        权限修饰符
            private 同一个类
            默认      同一个包总子类无关类
            protected   不同包的子类
            public     不同包的无关类
         状态修饰符
            final 修饰成员方法，成员变量，类
                方法：最终方法，不可重写
                变量：常量，不可再赋值
                类：最终类，不可被继承
                局部变量：
                    基本类型：基本类型变量的数据值不能改变
                    引用类型：引用类型的地址值不可发生改变，内容可以改变

            static 静态，修饰成员方法，成员变量
                特点：
                    被类的所有对象共享的
                    可以通过类名调用
                访问特点：
                    静态成员方法只能访问静态成员（变量和方法）
                    非静态成员方法既可以访问非静态成员又可以访问静态成员
* */
public class decorate {
}
